{
// –створити масив з:
//     – з 5 числових значень
    let arr = [3, 5, 6, 7, 8];
    console.log(arr);

// – з 5 стічкових значень
    let arr1 = ['23', 'ghghg', 'try', '0', 'iuy'];
    console.log(arr1);

// – з 5 значень стрічкового, числового та булевого типу
    let arr2 = ['23', 'ghghg', 'try', '0', 'iuy', true, false, 6, 789];
    console.log(arr2);

// – та вивести його в консоль

//----------------------------------------------------------

// — Створити пустий масив. Наповнити його будь-якими значеннями, звертаючись до конкретного індексу. Вивести в консоль
    let arr3 = [];
    arr3[0] = 56;
    arr3[1] = 'rtyrty';
    arr3[2] = false;
    arr3[3] = true;
    console.log(arr3);

//---------------------------------------------------------------
    let arr4 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];

//     1. перебрати його циклом while
    let i = 0;
    while (i < arr4.length) {
        console.log(arr4[i]);
        i++;
    }

//     2. перебрати його циклом for
    for (let i = 0; i < arr4.length; i++) {
        console.log(arr4[i]);
    }

//     3. перебрати циклом while та вивести  числа тільки з непарним індексом
    let j = 1;
    while (j < arr4.length) {
        console.log(arr4[j], 'index:', j);
        j += 2;
    }
//     4. перебрати циклом for та вивести  числа тільки з непарним індексом
    for (let i = 1; i < arr4.length; i += 2) {
        console.log(arr4[i], 'index:', i);
    }
//     5. перебрати циклом while та вивести  числа тільки парні  значення
    i = 0;
    while (i < arr4.length) {
        if (i % 2 === 0) {
            console.log(arr4[i], 'index:', i);
        }
        i++;
    }
//     6. перебрати циклом for та вивести  числа тільки парні  значення

    for(let i=0;i<arr4.length; i++){
        if(i%2===0){
            console.log(arr4[i], 'index:', i);
        }
    }
//     7. замінити кожне число, кратне 3, на слово “okten”


//      8. вивести масив у зворотньому порядку.
//
//     9. всі попередні завдання (окрім 8), але у зворотньому циклі (задом наперед)


}